;Inno Setup XDELTA Patch Language file v1.1 fix for ISXPM 2.2.0.0
;Language: German
;Author: j_h

[ISPATCH]
;Buttons
START_BUTTON='Start'
BROWSE_BUTTON='Durchsuchen'
INFO_BUTTON='Info'
EXIT_BUTTON='Beenden'
BACKUP_BUTTON='Backup speichern'
LOG_BUTTON='Log speichern'
MUSIC_BUTTON_PLAY='Musik'
MUSIC_BUTTON_PAUSE='Musik'
VERIFY_BUTTON='Hash prüfen'
CLOSE_BUTTON='Schliessen'

;Logs
ROLLBACK_STARTED='Zurückrollen gestartet!'
ROLLBACK_END='Fehler aufgetreten. Zurückrollen angewendet. Alle gepatchen Dateien wiederhergestellt.'

FAILED_TO_ROLLBACK='[!]  Fehler: Fehlschlag beim Zurückrollen von: '
FAILED_TO_ROLLBACK2=' Datei nach: '


ROLLBACK_SUCCESS2=' nach: '
ROLLBACK_SUCCESS3=' erfolgreich.'

FAILED_TO_DELETE_INCLUDED='[!]  Fehler: Löschen eingeschlossener Dateien fehlgeschlagen: '

INCLUDED_DELETED_SUCCESS2=' erfolgreich gelöscht.'

INCLUDED_DIR_DELETED2=' ist leer und wurde erfolgreich gelöscht.'

BACKUP_DIR_DELETED2=' wurde gelöscht.'

BACKUP_DIR_DELETED_NOT_FULLY2=' wurde geleert aber einige benutzte Dateien oder Ordner konnten nicht gelöscht werden. Prüfe dieses Verzeichnis für Details.'

ROLLBACK_FINISHED='Zurückrollen erledigt!'
PATCHING_FINIFHED_WITH_ERRORS='[!]  Patchen mit Fehlern erledigt!'

EXTRACT_TEMP_PATCH_DATA='Extrahiere Patch-Daten in das temporäre Verzeichnis...'

START_PATCHING='[Starte Patch-Sitzung]'

TARGET_FILE='--> Ziel-Datei: '
PATCH_DATA_FILE='=> Patch-Daten Datei: '
OUTPUT_PATCHED='>> Ausgabe gepatcht: '

ERROR_DELETING_OLD_FILE='[!]  Fehler beim Löschen der alten originalen Datei aufgetreten! Vielleicht ist sie gerade in Benutzung!'

NOT_EXISTS_OR_MISSMATCH='[!]  Fehler: Dateien zum Patchen im gewählten Verzeichnis existieren nicht oder stimmen nicht überein.'
CORRECT_PROBLEM='[!]  Bitte behebe das Problem und wende den Patch erneut an.'

PATCHING_END='[Beende Patch-Sitzung]'
COPYING_START='[Kopier-Sitzung gestartet]'

COPY_FAILED='[!]  Fehler: Konnte eingeschlossene Datei nicht kopieren: '
COPY_FAILED2=' nach:'

COPY_IN_USE='Vielleicht '
COPY_IN_USE2=' in Benutzung!'

INCLUDED_COPYIED2=' wird kopiert nach: '

COPYING_END='[Kopier-Sitzung beendet]'

TEMP_ROLLBACK_DELETED_IN_USE2=' wurde geleert aber einige Dateien oder Ordner konnten nicht gelöscht werden. Prüfe dieses Verzeichnis für Details.'

EXTERNAL_COPYIED='Zusätzliche externe Dateien wurden kopiert nach: '

STORED_BACKUP='Backup-Dateien gespeichert in: '

OPERATION_SUCCESS='Die Operation wurde erfolgreich abgeschlossen!'

;Checks
FIND_BY_WINDOW_NAME='Laufende Anwendung erkannt!'
FIND_BY_WINDOW_NAME2='Bitte schliessen '
FIND_BY_WINDOW_NAME3=' dann führe den Patch erneut aus!'

FIND_BY_CLASS_NAME='Laufende Anwendung erkannt!'
FIND_BY_CLASS_NAME2='Bitte schliessen '
FIND_BY_CLASS_NAME3=' dann führe den Patch erneut aus!'

FIND_BY_MUTEX='Laufende Anwendung erkannt!'
FIND_BY_MUTEX2='Bitte schliessen '
FIND_BY_MUTEX3=' dann führe den Patch erneut aus!'

FIND_BY_PROC='Laufende Anwendung erkannt!'
FIND_BY_PROC2='Bitte schliessen '
FIND_BY_PROC3=' dann führe den Patch erneut aus!'

;Errors
ORIGINAL_NOT_FOUND='Original installation not found! Please select a valid path!'

ROLLBACK_ERROR='Fehler beim Patchen aufgetreten und Patch wendet das Zurückrollen an.'
ROLLBACK_ERROR2='Zurückrollen der veränderten Dateien ist vollständig. Eingeschlossene Dateien wurden gelöscht.'
ROLLBACK_ERROR3='Entferne Backup-Verzeichnis: '
ROLLBACK_ERROR4='vollständig mit allen eingeschlossenen Dateien und Unterordnern?'

INCORRECR_PATH_ENTERED='Unzulässigen Pfad angegeben! Bitte wähle das Installations-Verzeichnis!'

NOTHING_TO_PATCH='Fehler! Im Installations-Verzeichnis befinden sich nicht die zum Patchen erforderlichen Dateien!'
NOTHING_TO_PATCH2='Bitte wähle die originalen Dateien oder dessen Dateinamen im ausgewählten Verzeichnis!'
NOTHING_TO_PATCH3='Nichts zu patchen!'
FINISHED_WITH_ERRORS='Patch mit Fehlern abgeschlossen! Prüfe das Log für Details!'
PATCH_UNSUCCESS='[!]  Fehler während des Patchens aufgetreten!'

;Informations
BROWSE_DIALOG='Bitte wähle den Ort zum Ziel-Verzeichnis aus:'

PATCHING_PROCESS='Patch-Prozess, bitte warten...'
PATCH_APPLIED='Patch wurde angewendet!'
PATCHING='Patchen: '
PATCHING_ERROR='Patch wurde nicht angewendet!'
PATCHING_PREPARING='Vorbereiten zum Patchen...'
COPYING_PROCESS='Kopier-Prozess, bitte warten...'
COPYING_EXTERNAL='Kopieren externer Dateien...'
FORM_CLOSED='Das Patch-Fenster schliesst automatisch nach '
FORM_CLOSED2=' Sekunden.'

;new 0.8
DELETING_JUNKED='[Starte Lösch-Prozess überflüssiger Dateien]'
COMPLETING_JUNKED='[Beende Lösch-Prozess überflüssiger Dateien]'
JUNKED_REMOVED='--> Entfernte überflüssige Datei: '
JUNKED_REM_FAILED='[!]  Entfernen überflüssiger Datei fehlgeschlagen: '
FAILED_TO_RESTORE='[!]  Fehler: Wiederherstellen überflüssiger Datei fehlgeschlagen von: '
FAILED_TO_RESTORE2=' nach: '
JUNKED_RESTORED='Überflüssige Datei: '
JUNKED_RESTORED2=' wurde erfolgreich wiederhergestellt.'

;new 0.9
;ALLREADY_UPDATED='Anwendung ist bereits aktualisiert!'


; Language update 0.9a for ISXPM 2.0.0.0 beta 1 
INCORRECT_HASH='Prüfsummen-Hash ist nicht von originaler Datei!'
INCORRECT_HASH2='Bitte prüfe deine Programm-Version!
INVALID_HASH='[!]  Fehler! Ungültige Prüfsumme für: '
VALID_HASH='OK! Gültige Prüfsumme für: '

SET_ATTRIBUTES='Setze Datei-Attribute...'
SET_ATTRIBUTES_FAILED='[!]  Setzen originaler Attribute fehlgeschlagen für Datei: '
SET_ATTRIBUTES_SUCCESS='Datei-Attribute wurden erfolgreich gesetzt!'
SET_ATTRIBUTES_UNSUCCESS='[!]  Einige Datei-Attribute wurden nicht gesetzt!'

HANDLE_ERROR='[!]  Kritischer Fehler aufgetreten beim Zugriff auf: '

GET_TIME_FAILED='[!]  Erhalten der Zeit-Attribute von Datei fehlgeschlagen: '
SET_TIME_FAILED='[!]  Setzen der Zeit-Attribute für Datei fehlgeschlagen: '

VERIFICATION_START='Starte Datei-Überprüfungsprozess...'
VERIFICATION_FINISH='Alle Datei-Prüfsummen sind richtig!'

PREPARING_TO_OPERATIONS='Vorbereiten auf nächste Operationen, warten auf Entladen der Patch-Engine...'

FORCE_PATCHING='Patchen wird im erzwungenen Modus ausgeführt!'
FORCE_PATCHING2='Es werden nur existierende erforderliche Dateien aktualisiert, alle nicht existierenden werden übersprungen...'

COPYING_EXTERNAL_FILE='--> Kopiere Datei nach: '
COPYING_EXTERNAL_FILE_FAILED='[!]  Beim Kopieren der Datei ist ein Fehler aufgetreten: '  

EXTRACTING_PROCESS='Extrahiere externe Dateien...'
EXTRACTING_EXTERNAL_FILE='--> Extrahiere Datei nach: '
EXTERNAL_EXTRACTED='Zusätzliche externe Dateien wurden extrahiert nach: '
EXTRACTING_START='Extrahierungs-Prozess, bitte warten...'

EXTRACTING_ERROR='[!]  Extrahieren fehlgeschlagen! Vielleicht ist das Archiv zerstört oder nicht genügend freier Platz vorhanden!'
EXTRACTING_ERROR2='Fehler aufgetreten beim Extrahieren des Archivs!'
EXTRACTING_ERROR3='Vielleicht ist das Archiv zerstört oder nicht genügend freier Platz vorhanden!'
EXTRACTING_WITH_ERRORS='Archiv-Extrahierung wurde mit Fehlern abgeschlossen! Prüfe das Log für Details!'

DOWNLOAD_REQUIRED='Dieser Patch erfordert den Download einiger Daten von einem Server!'
DOWNLOAD_FAILED='[!]  Nicht möglich den Patch-Prozess fortzusetzen ohne die erforderlichen Daten!'
DOWNLOAD_FAILED2='Bitte ermögliche den Zugriff auf die Server-Verbindung und versuche den Patch erneut anzuwenden!'

DOWNLOAD_MIRROR='Download der Daten vom Hauptserver fehlgeschlagen! Versuche vom Mirror herunterzuladen...'
DOWNLOAD_START='Lade Daten herunter: '
DOWNLOAD_START2='In das Zielverzeichnis: '
DOWNLOAD_START3='Gesamte Größe: '

READ_OK='Der Download wurde erfolgreich abgeschlossen!'
CONNECT_ERROR_NETWORK='[!]  Fehler: Es gibt keine Internet-Verbindung oder alle möglichen Internet-Verbindungen sind zur Zeit nicht aktiv.'
CONNECT_ERROR_OFFLINE='[!]  Fehler: Der Computer ist im Offline-Modus.'
CONNECT_ERROR_INITIALIZE='[!]  Fehler: Initialisieren des Installations-Pakets für den Zugriff auf das Internet fehlgeschlagen.'
CONNECT_ERROR_OPENSESSION='[!]  Fehler: FTP- oder HTTP-Sitzung konnte nicht geöffnet werden.'
CONNECT_ERROR_CREATEREQUEST='[!]  Fehler: Erstellen eines HTTP Request-Handles fehlgeschlagen.'
CONNECT_ERROR_SENDREQUEST='[!]  Fehler: Senden einer Anfrage an den HTTP-Server fehlgeschlagen.'
READ_ERROR_DELETEFILE='[!]  Fehler: Die lokale Datei existiert bereits und sie zu löschen ist fehlgeschlagen.'
READ_ERROR_SAVEFILE='[!]  Fehler: Speichern der Daten in lokaler Datei fehlgeschlagen.'
READ_ERROR_CANCELED='[!]  Fehler: Die Download-Operation wurde durch den Benutzer abgebrochen.'
READ_ERROR_READDATA='[!]  Fehler: Lesen der Daten der Remote-URL fehlgeschlagen.'
UNKNOWN_ERROR='[!]  Unbekannter Fehler: Der HTTP-Statuscode ist: '

CANCEL_DOWNLOAD_BUTTON='Download abbrechen'

;old corrected
TOTAL_PATCHED_FILES='Gesamte verarbeitete Dateien: '
PATCHING_LOG='Patch-Log gespeichert nach: '
INCLUDED_COPYIED='--> Eingeschlossene Datei: '
TEMP_ROLLBACK_DELETED='Temporäre Dateien zum Zurückrollen wurden gelöscht aus: '
DIRECT_PATCH_DATA='Direkt-Zugriff auf Patch-Daten...'

;Strings
DESCRIPTION='Beschreibung :'
COPYRIGHT='Urheberrecht :'
CONTACT='Kontakt :'
INSTALLATION='Installation :'

;no more used this strings from previous old translation versions
;INCORRECT_MD5='MD5 hash is a not from original file!'
;INCORRECT_MD52='Please check your program version!'
;INVALID_HASH='[!]  Invalid MD5 hash for updated file: '
;VALID_HASH='Valid MD5 hash for updated file: '
;TEMP_ROLLBACK_DELETED2=' was deleted.'

; Language update 0.9b for ISXPM 2.0.0.0 beta 2 
PATCH_TO='Patchen in'
FOUNDED_VERSION='Gefundene installierte Version: '
VERSION_TO_PATCH='Vorbereiten auf das Patchen gefundener Version: '

;old corrected:
;INSTALL_PATH_NOT_FOUND='Installations-Pfad für erforderliche Version nicht gefunden! Bitte wähle ihn manuell!'

ALLREADY_UPDATED='Anwendung an diesem Ort ist bereits aktualisiert!'
ROLLBACK_SUCCESS=Zurückrollen: '
INCLUDED_DIR_DELETED='Eingeschlossenes Verzeichnis: '
INCLUDED_DELETED_SUCCESS='Eingeschlossen: '
BACKUP_DIR_DELETED='Backup Verzeichnis: '
BACKUP_DIR_DELETED_NOT_FULLY='Backup Verzeichnis: '
TEMP_ROLLBACK_DELETED_IN_USE='Temporäres Verzeichnis zum Zurückrollen: '

; Language update 1.0 for ISXPM 2.0.0.0
EXTRACT_TO_TEMP='Extrahiere erforderliche temporäre Daten...'
EXTRACT_TO_TEMP2='Extrahierungs-Prozess, bitte warten...'
FOUNDED_VERSION_READY='Bereit zum Patchen!'
FILE_NOT_EXISTS='[!]  Für den Prozess erforderliche Datei existiert nicht: '

;old corrected:
INSTALL_PATH_NOT_FOUND='Installations-Pfad für erforderliche Version nicht gefunden! Bitte wähle ihn!'
FOUNDED_VERSION2='Installierte Version gefunden! Bereit zum Patchen!'
VERIFICATION_UNSUCCESS='[!]  Einige Dateien existieren nicht oder haben ungültige Prüfsumme!'
UNKNOWN_PATCHING_ERROR='[!]  Einige Fehler sind aufgetreten beim Anwenden der Patch-Daten auf: '

; Language update 1.1 for ISXPM 2.2.0.0 
LOG_BTN_STATE='Log'

S_PATCHING='--> Patche Datei: '
S_COPYING='--> Kopiere Datei: '
S_EXTRACTING='--> Extrahiere Datei: '
S_COPYING_EXTERNAL='--> Kopiere externe Datei: '
S_ROLLBACK='--> Datei zum Zurückrollen: '
S_DELETING='--> Zu löschende Datei: '
S_JUNKED_RESTORED='--> Wiederhergestellte überflüssige Datei: '
S_INVALID_FILE='[!]  Ungültige Datei: '
S_VALID_FILE='OK! Gültige Datei: '

; Language update 1.2 for ISXPM 2.3.0.0 
VERSION_DETECTING='Erkenne Version... Bitte warten...'

; Language update 1.2.1 for ISXPM 2.3.1.0 
FILE_SKIPPED='[!]  Folgende Dateien existieren nicht und wurden übersprungen: '

; Language update 1.3 for ISXPM 2.4.0.0 
GET_SPACE_FAILED='Ermitteln des freien Speicherplatzes fehlgeschlagen auf '
REQUIRED_SPACE='Erforderlicher Platz für erfolgreiches Updaten ist '
SPACE_GB='GB!'
SPACE_MB='MB!'
SPACE_ONLY='Es gibt nur '
SPACE_GB_FREE='GB frei auf Laufwerk '
SPACE_MB_FREE='MB frei auf Laufwerk '
SPACE_FREE_ONLY='Nur frei '
